{
  "Science & Technology": "Explore the world of science and technology, from groundbreaking innovations to the latest discoveries in engineering, robotics, and computer science. Test your knowledge about famous inventors, tech trends, and scientific principles that shape our modern world.",
  "General Knowledge": "A diverse mix of questions covering a wide range of topics including history, geography, current events, and more. Perfect for testing your general awareness and trivia skills across multiple fields of knowledge.",
  "Pop Culture": "Dive into the world of pop culture with questions about current celebrities, TV shows, viral moments, and trending topics. Challenge yourself with the latest in entertainment, social media, and celebrity news.",
  "Literature & Books": "Test your literary knowledge with questions about classic novels, modern literature, famous authors, and literary terms. Whether you're a bookworm or an occasional reader, there's something here for everyone.",
  "Geography": "Discover the world's wonders with questions about countries, capitals, landmarks, and geographical features. Explore maps, cultures, and the fascinating world of physical geography.",
  "Movies & TV Shows": "From blockbuster films to iconic TV series, this category covers everything related to the world of entertainment. Whether you're a movie buff or a TV series enthusiast, test your knowledge of film history, quotes, and more.",
  "Music Through the Decades": "Test your musical knowledge from every era, spanning different genres and iconic songs. From the classics to contemporary hits, this category will challenge your memory of tunes from the past to the present.",
  "Sports & Athletics": "Put your athletic knowledge to the test with questions about various sports, teams, athletes, and major sporting events. Whether you're a fan of football, basketball, or athletics, challenge your sports trivia skills.",
  "Plant Based Diet": "Explore the world of plant-based eating, from healthy meal ideas to the environmental and ethical benefits of a plant-based diet. Test your knowledge about veganism, vegetarianism, and sustainable food practices.",
  "Art & Architecture": "Test your understanding of famous art movements, renowned artists, and iconic architectural masterpieces. Whether it's painting, sculpture, or modern design, this category challenges your artistic knowledge.",
  "Ancient Civilizations": "Travel back in time and test your knowledge about ancient civilizations, from Egypt to Mesopotamia. Explore their cultures, achievements, and contributions to the world we know today.",
  "Famous Personalities": "Learn about some of the world's most influential figures, from historical leaders to modern-day icons. This category covers a wide range of famous personalities who shaped history in politics, culture, and more.",
  "Natural Wonders": "Explore the beauty of Earth's natural wonders, from the Great Barrier Reef to the Grand Canyon. This category will challenge your knowledge of the planet's most awe-inspiring landscapes and ecosystems.",
  "Inventions & Discoveries": "Test your knowledge of the inventions and discoveries that changed the world. From the wheel to modern technology, learn about the brilliant minds and groundbreaking ideas that have shaped human progress.",
  "Mythology & Folklore": "Venture into the world of myths and legends with questions about gods, heroes, and mythical creatures from cultures around the world. Dive into tales of ancient civilizations and explore timeless stories passed down through generations.",
  "Language & Word Origins": "Discover the fascinating origins of words and phrases from around the world. Explore the etymology of languages and test your knowledge of linguistics and language history.",
  "Wildlife & Nature": "Celebrate the beauty and diversity of nature with questions about wildlife, ecosystems, and conservation efforts. Learn about endangered species, animal behavior, and the planet's most extraordinary creatures.",
  "Space & Astronomy": "Challenge your knowledge of the universe, from planets and stars to galaxies and black holes. Explore the wonders of space, space exploration, and celestial phenomena that continue to captivate humanity's imagination.",
  "Board Games & Video Games": "Test your knowledge of classic board games and the world of video games. Whether it's strategy, trivia, or gaming history, this category covers it all—from Monopoly to modern eSports.",
  "Odd Facts & Trivia": "A fun and quirky category filled with strange, fascinating, and unusual facts. Discover bizarre trivia that will challenge your knowledge of the odd and unexpected.",
  "Health & Human Body": "Explore the intricacies of the human body and the science of health. Test your knowledge of anatomy, diseases, medical advances, and tips for maintaining a healthy lifestyle.",
  "Business & Economics": "Dive into the world of business, finance, and economics. This category will test your understanding of global markets, entrepreneurship, economic principles, and financial trends.",
  "Puzzles & Brain Teasers": "Engage your mind with puzzles and brain teasers that challenge your problem-solving abilities. From riddles to logic puzzles, test your intellectual agility and critical thinking skills.",
  "World History": "Learn about the key events, movements, and figures that have shaped global history. From ancient civilizations to modern revolutions, this category covers the vast and complex history of human civilization.",
  "Fashion Through the Ages": "Travel through time and explore the evolution of fashion. From ancient attire to contemporary style, this category tests your knowledge of iconic trends and the fashion industry.",
  "Famous Landmarks": "Discover the world's most famous landmarks, from the Eiffel Tower to the Great Wall of China. Test your knowledge of these iconic sites, their history, and cultural significance.",
  "Environmental Science": "Learn about environmental issues, sustainability, and the science of ecology. This category covers topics related to climate change, conservation, and the science of protecting our planet.",
  "Cryptic Codes & Ciphers": "Test your ability to decipher cryptic codes, ciphers, and puzzles. This category challenges your skills in logic, cryptography, and pattern recognition.",
  "Musical Instruments": "Explore the world of musical instruments, from classical to contemporary. Test your knowledge of instrument families, famous musicians, and the science of sound.",
  "Ocean Life": "Dive deep into the world's oceans and learn about marine life, ecosystems, and the creatures that inhabit them. This category will challenge your knowledge of oceanography and the species living beneath the waves.",
  "Extreme Weather": "Explore the forces of nature that create extreme weather phenomena, from hurricanes to tornadoes. Test your knowledge of climate systems, weather patterns, and the science behind natural disasters.",
  "Animated Films": "Celebrate the magic of animated films, from Disney classics to modern CGI wonders. Test your knowledge of animation history, iconic characters, and groundbreaking animated features.",
  "Social Media & Internet Culture": "Challenge your understanding of social media trends, internet memes, and online culture. This category covers the ever-changing world of digital communication and viral moments.",
  "Olympic Games": "Test your knowledge of the world's premier sporting event, the Olympic Games. From historical milestones to the greatest athletes, this category covers all things Olympic.",
  "Unusual Hobbies": "Discover unique and unconventional hobbies that people around the world enjoy. Whether it's collecting rare items or practicing odd skills, this category celebrates the strange and unusual.",
  "Fictional Worlds & Universes": "Step into the realms of imagination with questions about fictional worlds from books, movies, and games. Whether it’s Middle-earth, Hogwarts, or a galaxy far, far away, this category explores the lore, characters, and settings of beloved universes.",
  "Dinosaurs & Prehistoric Life": "Travel back in time to the age of the dinosaurs and other prehistoric creatures. Learn about the different species, their habitats, extinction theories, and the science of paleontology.",
  "Famous Quotes & Speeches": "Test your knowledge of powerful quotes and historic speeches that left a mark on the world. Match the words to the figures who spoke them and uncover the moments that made history.",
  "Transportation & Vehicles": "Explore the evolution of transportation—from early inventions like the wheel to modern innovations like electric cars and space travel. This category covers land, air, and sea vehicles throughout history.",
  "TV Sitcoms & Comedy Shows": "Celebrate the best in comedic television, from classic sitcoms to modern favorites. Identify characters, memorable moments, and trivia from shows that have kept audiences laughing for decades.",
  "Wonders of the Modern World": "Discover human-made marvels of engineering and architecture that define our era. From towering skyscrapers to engineering feats, this category explores achievements of the modern age.",
  "Paranormal & Supernatural": "Delve into the eerie and unexplained with trivia about ghosts, UFOs, cryptids, and urban legends. Test your knowledge of supernatural phenomena from folklore and pop culture.",
  "Historical Conflicts & Wars": "Examine major conflicts that have shaped global history, from ancient battles to world wars. Learn about the causes, key figures, and outcomes of humanity’s most defining struggles.",
  "Food & Culinary Arts": "Savor the flavors of global cuisine and test your knowledge of dishes, ingredients, cooking techniques, and food history. This category is a feast for food lovers and chefs alike.",
  "Logic & Deduction": "Sharpen your reasoning with puzzles that require step-by-step logic and critical thinking. Challenge yourself with problems that test your ability to deduce, infer, and solve efficiently.",
  "TV Game Shows": "Explore the world of TV game shows, from classic formats to modern hits. Test your trivia about hosts, catchphrases, and the exciting challenges that made them popular.",
  "World Religions & Beliefs": "Learn about the beliefs, traditions, and origins of the world’s major religions and spiritual systems. Explore the practices and philosophies that guide billions of people around the globe.",
  "Royalty & Monarchies": "Test your knowledge of royal families, famous kings and queens, and the traditions of monarchies past and present. Dive into the history and influence of global dynasties.",
  "Famous Duos & Teams": "From dynamic duos in fiction to real-life partnerships in sports, entertainment, and history, this category celebrates teamwork and unforgettable pairings. See how well you know the world’s greatest tag-teams.",
  "Innovation & Future Tech": "Peek into the future with questions about emerging technologies and cutting-edge inventions. Explore AI, robotics, space exploration, and more as you test your knowledge of what lies ahead."
}
